In [8]:
##missing values
import pandas as ap
cravin=ap.read_csv("D:/rah.csv")
print(cravin)

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0   NaN
2  dharan      NaN  20.0
3  satish  10000.0  30.0

In [9]:
dharan=cravin.fillna(value=20)

In [10]:
print(dharan)

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0  20.0
2  dharan     20.0  20.0
3  satish  10000.0  30.0

In [16]:
cravin.isnull()

    name  salary   days
0  False   False  False
1  False   False   True
2  False    True  False
3  False   False  False

In [17]:
cravin.isnull().sum()

name      0
salary    1
days      1
dtype: int64

In [18]:
cravin.isnull().sum().sum()

2

In [20]:
dharan=cravin.fillna(method='pad')
dharan

C:\Users\Arun\AppData\Local\Temp\ipykernel_2400\2198292211.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  dharan=cravin.fillna(method='pad')

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0  15.0
2  dharan  20000.0  20.0
3  satish  10000.0  30.0

In [21]:
dharan=cravin.fillna(method='bfill')
dharan

C:\Users\Arun\AppData\Local\Temp\ipykernel_2400\2462185051.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  dharan=cravin.fillna(method='bfill')

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0  20.0
2  dharan  10000.0  20.0
3  satish  10000.0  30.0

In [23]:
dharan=cravin.fillna(method='bfill',axis=1)
dharan

C:\Users\Arun\AppData\Local\Temp\ipykernel_2400\1752055787.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  dharan=cravin.fillna(method='bfill',axis=1)

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0   NaN
2  dharan     20.0  20.0
3  satish  10000.0  30.0

In [24]:
import pandas as ap

In [25]:
from sklearn.model_selection import train_test_split

In [29]:

cravin=ap.read_csv("D:/rah.csv")
print(cravin)

     name   salary  days
0  cravin  15000.0  15.0
1   rahul  20000.0   NaN
2  dharan      NaN  20.0
3  satish  10000.0  30.0

In [34]:
x=cravin.drop(columns=["salary"])

In [35]:
x.head()

     name  days
0  cravin  15.0
1   rahul   NaN
2  dharan  20.0
3  satish  30.0

In [38]:
x.shape

(4, 2)

In [40]:
x_train,x_test=train_test_split(x,random_state=11,test_size=0.2)

In [41]:
x_train.shape

(3, 2)

In [42]:
x_test.shape

(1, 2)

In [45]:
x_train.head()

     name  days
3  satish  30.0
0  cravin  15.0
1   rahul   NaN

In [46]:
x_train.describe()

            days
count   2.000000
mean   22.500000
std    10.606602
min    15.000000
25%    18.750000
50%    22.500000
75%    26.250000
max    30.000000

In [47]:
x_test.describe()

       days
count   1.0
mean   20.0
std     NaN
min    20.0
25%    20.0
50%    20.0
75%    20.0
max    20.0

In [48]:
pip install Augmentor

Collecting Augmentor
  Downloading Augmentor-0.2.12-py2.py3-none-any.whl.metadata (1.3 kB)
Requirement already satisfied: Pillow>=5.2.0 in c:\users\arun\anaconda3\lib\site-packages (from Augmentor) (10.4.0)
Requirement already satisfied: tqdm>=4.9.0 in c:\users\arun\anaconda3\lib\site-packages (from Augmentor) (4.66.5)
Requirement already satisfied: numpy>=1.11.0 in c:\users\arun\anaconda3\lib\site-packages (from Augmentor) (1.26.4)
Requirement already satisfied: colorama in c:\users\arun\appdata\roaming\python\python312\site-packages (from tqdm>=4.9.0->Augmentor) (0.4.6)
Downloading Augmentor-0.2.12-py2.py3-none-any.whl (38 kB)
Installing collected packages: Augmentor
Successfully installed Augmentor-0.2.12
Note: you may need to restart the kernel to use updated packages.

In [53]:
import Augmentor
p = Augmentor.Pipeline("C:/Users/Arun/Pictures/image.jpg")
p.rotate(probability=0.7, max_left_rotation=10, max_right_rotation=10)
p.flip_left_right(probability=0.5)
p.zoom_random(probability=0.5, percentage_area=0.8)
p.random_contrast(probability=0.3, min_factor=0.7, max_factor=1.3)
p.sample(100)

Insufficient rights to read or write output directory (C:/Users/Arun/Pictures/image.jpg\output)
Initialised with 0 image(s) found.
Output directory set to C:/Users/Arun/Pictures/image.jpg\output.

C:\Users\Arun\anaconda3\Lib\site-packages\Augmentor\Pipeline.py:1086: SyntaxWarning: invalid escape sequence '\B'
  """

IndexError: There are no images in the pipeline. Add a directory using add_directory(), pointing it to a directory containing images.